import 'package:fitmate_app/model/common/Region.dart';

class RegionData {
  static final List<Region> defaultRegions = [
    Region('서울', [
      '전체', '강남', '강동', '강북',
      '강서', '관악', '광진', '구로',
      '금천', '노원', '도봉', '동대문',
      '동작', '마포', '서대문', '서초',
      '성동', '성북', '성북', '송파',
      '양천', '영등포', '용산', '은평',
      '종로', '중구', '중랑'
    ]),
    Region('경기', [
      '전체', '수원', '성남', '고양',
      '용인', '부천', '안산', '안양',
      '남양주', '화성', '의정부', '시흥',
      '평택', '광명', '파주', '군포',
      '광주', '김포', '이천', '양주',
      '구리', '오산', '안성', '의왕',
      '하남', '포천', '동두천', '과천',
      '여주', '양평', '가평', '연천'
    ]),
    Region('인천', [
      '전체', '중구', '동구', '미추홀',
      '연수', '남동', '부평', '계양',
      '서구', '강화', '웅진'
    ]),
    Region('강원', [
      '전체', '춘천', '인제', '양구',
      '고성', '양양', '강릉', '속초',
      '삼척', '정선', '평창', '영월',
      '원주', '횡성', '홍천', '화천',
      '철원', '동해', '태백'
    ]),
    Region('충북', [
      '전체', '청주', '충주', '제천',
      '보은', '옥천', '영동', '증평',
      '진천', '괴산', '음성', '단양'
    ]),
    Region('충남', [
      '전체', '천안', '공주', '보령',
      '아산', '서산', '논산', '계룡',
      '당진', '금산', '부여', '서천',
      '청양', '홍성', '예산', '태안'
    ]),
    Region('세종', [
      '전체', '조치원', '연기', '연동',
      '부강', '금남', '장군', '연서',
      '전의', '전동', '소정', '한솔',
      '새롬', '도담', '아름', '종촌',
      '고운', '소담', '보람', '대평',
      '다정', '해밀', '반곡'
    ]),
    Region('대전', [
      '전체', '동구', '중구', '서구',
      '유성', '대덕'
    ]),
    Region('광주', [
      '전체', '동구', '서구', '남구',
      '북구', '광산'
    ]),
    Region('전북', [
      '전체', '전주', '익산', '군산',
      '정읍', '남원', '김제', '완주',
      '고창', '부안', '임실', '순창',
      '진안', '무주', '장수'
    ]),
    Region('경북', [
      '전체', '포항', '경주', '김천',
      '안동', '구미', '영주', '영천',
      '상주', '문경', '경산', '군위',
      '의성', '청송', '영양', '영덕',
      '청도', '고령', '성주', '칠곡',
      '예천', '봉화', '울진', '울릉'
    ]),
    Region('대구', [
      '전체', '중구', '동구', '서구',
      '남구', '북구', '수성', '달서',
      '달성'
    ]),
    Region('제주', [
      '전체', '제주', '한림', '애월',
      '구좌', '조천', '한경', '추자',
      '우도', '서귀포', '대정', '남원',
      '성산', '안덕', '표선'
    ]),
    Region('전남', [
      '전체', '목포', '여수', '순천',
      '나주', '광양', '담양', '곡성',
      '구례', '고흥', '보성', '화순',
      '장흥', '강진', '해남', '영암',
      '무안', '함평', '영광', '장성',
      '완도', '진도', '신안'
    ]),
    Region('경남', [
      '전체', '창원', '김해', '양산',
      '진주', '거제', '통영', '사천',
      '밀양', '함안', '거창', '창녕',
      '고성', '하동', '합천', '남해',
      '함양', '산청', '의령'
    ]),
    Region('울산', [
      '전체', '중구', '남구', '동구',
      '북구', '울주군',
    ]),
    Region('부산', [
      '전체', '중구', '서구', '동구',
      '영도', '부산진구', '동래', '남구',
      '북구', '강서', '해운대', '사하',
      '금정', '연제', '수영', '사상',
      '기장'
    ]),
  ];
}
